cavity_temp/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall  // Previously part of fixedWalls
    {
        type wall;
        faces ((0 4 7 3));
    }
    rightWall  // Previously part of fixedWalls
    {
        type wall;
        faces ((2 6 5 1));
    }
    bottomWall  // Previously part of fixedWalls
    {
        type wall;
        faces ((1 5 4 0));
    }
    topWall  // Renamed from movingWall
    {
        type wall;
        faces ((3 7 6 2));
    }
    frontAndBack
    {
        type wall;
        faces ((0 3 2 1) (4 5 6 7));
    }
);


// ************************************************************************* //
