cavity_temp/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PCG;  // More efficient for Poisson
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }
}

// Remove/comment out the PISO block (no flow solved)

// PISO
// {
//     nCorrectors     2;
//     nNonOrthogonalCorrectors 0;
//     pRefCell        0;
//     pRefValue       0;
// }


// ************************************************************************* //

