cavity_temp/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    box1;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 0 0) (1 1 1);
    }
);



